; ModuleID = 'jni.c'
source_filename = "jni.c"
target datalayout = "e-m:w-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7-pc-windows-msvc19.20.0"

%union.jvalue = type { i64 }
%struct.JNINativeInterface_ = type { ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

$sprintf = comdat any

$vsprintf = comdat any

$_snprintf = comdat any


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_OptionsStorage", scope: !2, file: !3, line: 91, type: !7, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "__local_stdio_printf_options", scope: !3, file: !3, line: 89, type: !4, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!3 = !DIFile(filename: "C:\\Program Files (x86)\\Windows Kits\\10\\Include\\10.0.22621.0\\ucrt\\corecrt_stdio_config.h", directory: "", checksumkind: CSK_MD5, checksum: "dacf907bda504afb0b64f53a242bdae6")
!4 = !DISubroutineType(types: !5)
!5 = !{!6}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!8 = distinct !DICompileUnit(language: DW_LANG_C99, file: !9, producer: "clang version 15.0.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !19, globals: !1032, splitDebugInlining: false, nameTableKind: None)
!9 = !DIFile(filename: "jni.c", directory: "c:\\dev\\ikvm\\src\\IKVM.Runtime\\LLIR", checksumkind: CSK_MD5, checksum: "8ccde5e6b3790ecbde9190016dbdf76e")
!10 = !{!11}
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_jobjectType", file: !12, line: 139, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "..\\..\\..\\openjdk\\jdk\\src\\share\\javavm\\export\\jni.h", directory: "c:\\dev\\ikvm\\src\\IKVM.Runtime\\LLIR", checksumkind: CSK_MD5, checksum: "7756575af5344f8caa05083993b01fbd")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18}
!15 = !DIEnumerator(name: "JNIInvalidRefType", value: 0)
!16 = !DIEnumerator(name: "JNILocalRefType", value: 1)
!17 = !DIEnumerator(name: "JNIGlobalRefType", value: 2)
!18 = !DIEnumerator(name: "JNIWeakGlobalRefType", value: 3)
!19 = !{!20, !81, !56, !164, !167, !40, !171, !174, !177, !48, !1029}
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetMethodArgs_t", file: !21, line: 21, baseType: !22)
!21 = !DIFile(filename: "./jni.h", directory: "c:\\dev\\ikvm\\src\\IKVM.Runtime\\LLIR", checksumkind: CSK_MD5, checksum: "4b5ea295cd406f875114a7ed8415f568")
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 32)
!23 = !DISubroutineType(types: !24)
!24 = !{!13, !25, !67, !151}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "JNIEnv", file: !12, line: 197, baseType: !27)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 32)
!28 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JNINativeInterface_", file: !12, line: 214, size: 7456, elements: !30)
!30 = !{!31, !33, !34, !35, !36, !43, !59, !63, !70, !77, !83, !87, !91, !95, !100, !104, !108, !112, !113, !117, !121, !125, !126, !130, !131, !135, !136, !137, !141, !145, !152, !180, !184, !188, !192, !196, !200, !204, !208, !212, !216, !220, !224, !228, !232, !236, !240, !244, !248, !252, !256, !260, !264, !268, !272, !276, !280, !284, !288, !292, !296, !300, !304, !308, !312, !316, !320, !324, !328, !332, !336, !340, !344, !348, !352, !356, !360, !364, !368, !372, !376, !380, !384, !388, !392, !396, !400, !404, !408, !412, !416, !420, !424, !428, !432, !436, !440, !444, !448, !452, !456, !460, !464, !468, !472, !476, !480, !484, !488, !492, !496, !500, !504, !508, !509, !510, !511, !512, !516, !520, !524, !528, !532, !536, !540, !544, !548, !552, !556, !560, !564, !568, !572, !576, !580, !584, !588, !592, !596, !600, !604, !608, !612, !616, !620, !621, !625, !629, !633, !637, !641, !645, !649, !653, !657, !661, !665, !669, !673, !677, !681, !685, !689, !693, !700, !704, !709, !713, !717, !718, !722, !726, !731, !736, !740, !744, !749, !754, !759, !764, !769, !774, !779, !784, !788, !793, !798, !803, !808, !813, !818, !823, !827, !831, !835, !839, !843, !847, !851, !855, !859, !863, !867, !871, !875, !879, !883, !887, !893, !897, !901, !907, !913, !919, !925, !931, !943, !947, !951, !952, !981, !985, !989, !993, !997, !998, !999, !1004, !1008, !1012, !1016, !1020, !1024}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "reserved0", scope: !29, file: !12, line: 215, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !29, file: !12, line: 216, baseType: !32, size: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !29, file: !12, line: 217, baseType: !32, size: 32, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "reserved3", scope: !29, file: !12, line: 219, baseType: !32, size: 32, offset: 96)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "GetVersion", scope: !29, file: !12, line: 220, baseType: !37, size: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DISubroutineType(types: !39)
!39 = !{!40, !25}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "jint", file: !41, line: 33, baseType: !42)
!41 = !DIFile(filename: "..\\..\\..\\openjdk\\jdk\\src\\windows\\javavm\\export\\jni_md.h", directory: "c:\\dev\\ikvm\\src\\IKVM.Runtime\\LLIR", checksumkind: CSK_MD5, checksum: "1ea1808175ba5b9740cb94cde3a9f925")
!42 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "DefineClass", scope: !29, file: !12, line: 222, baseType: !44, size: 32, offset: 160)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !25, !51, !48, !54, !58}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "jclass", file: !12, line: 102, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobject", file: !12, line: 101, baseType: !49)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DICompositeType(tag: DW_TAG_structure_type, name: "_jobject", file: !12, line: 99, flags: DIFlagFwdDecl)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "jbyte", file: !41, line: 35, baseType: !57)
!57 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "jsize", file: !12, line: 63, baseType: !40)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "FindClass", scope: !29, file: !12, line: 225, baseType: !60, size: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DISubroutineType(types: !62)
!62 = !{!47, !25, !51}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "FromReflectedMethod", scope: !29, file: !12, line: 228, baseType: !64, size: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 32)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !25, !48}
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmethodID", file: !12, line: 136, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 32)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_jmethodID", file: !12, line: 135, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "FromReflectedField", scope: !29, file: !12, line: 230, baseType: !71, size: 32, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !25, !48}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "jfieldID", file: !12, line: 133, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_jfieldID", file: !12, line: 132, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ToReflectedMethod", scope: !29, file: !12, line: 233, baseType: !78, size: 32, offset: 288)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{!48, !25, !47, !67, !81}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "jboolean", file: !12, line: 57, baseType: !82)
!82 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "GetSuperclass", scope: !29, file: !12, line: 236, baseType: !84, size: 32, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!85 = !DISubroutineType(types: !86)
!86 = !{!47, !25, !47}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "IsAssignableFrom", scope: !29, file: !12, line: 238, baseType: !88, size: 32, offset: 352)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DISubroutineType(types: !90)
!90 = !{!81, !25, !47, !47}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ToReflectedField", scope: !29, file: !12, line: 241, baseType: !92, size: 32, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DISubroutineType(types: !94)
!94 = !{!48, !25, !47, !74, !81}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Throw", scope: !29, file: !12, line: 244, baseType: !96, size: 32, offset: 416)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 32)
!97 = !DISubroutineType(types: !98)
!98 = !{!40, !25, !99}
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "jthrowable", file: !12, line: 103, baseType: !48)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "ThrowNew", scope: !29, file: !12, line: 246, baseType: !101, size: 32, offset: 448)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!102 = !DISubroutineType(types: !103)
!103 = !{!40, !25, !47, !51}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptionOccurred", scope: !29, file: !12, line: 248, baseType: !105, size: 32, offset: 480)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DISubroutineType(types: !107)
!107 = !{!99, !25}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptionDescribe", scope: !29, file: !12, line: 250, baseType: !109, size: 32, offset: 512)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = !DISubroutineType(types: !111)
!111 = !{null, !25}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptionClear", scope: !29, file: !12, line: 252, baseType: !109, size: 32, offset: 544)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "FatalError", scope: !29, file: !12, line: 254, baseType: !114, size: 32, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !25, !51}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "PushLocalFrame", scope: !29, file: !12, line: 257, baseType: !118, size: 32, offset: 608)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DISubroutineType(types: !120)
!120 = !{!40, !25, !40}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "PopLocalFrame", scope: !29, file: !12, line: 259, baseType: !122, size: 32, offset: 640)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!123 = !DISubroutineType(types: !124)
!124 = !{!48, !25, !48}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "NewGlobalRef", scope: !29, file: !12, line: 262, baseType: !122, size: 32, offset: 672)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteGlobalRef", scope: !29, file: !12, line: 264, baseType: !127, size: 32, offset: 704)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !25, !48}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteLocalRef", scope: !29, file: !12, line: 266, baseType: !127, size: 32, offset: 736)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "IsSameObject", scope: !29, file: !12, line: 268, baseType: !132, size: 32, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DISubroutineType(types: !134)
!134 = !{!81, !25, !48, !48}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "NewLocalRef", scope: !29, file: !12, line: 270, baseType: !122, size: 32, offset: 800)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "EnsureLocalCapacity", scope: !29, file: !12, line: 272, baseType: !118, size: 32, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "AllocObject", scope: !29, file: !12, line: 275, baseType: !138, size: 32, offset: 864)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DISubroutineType(types: !140)
!140 = !{!48, !25, !47}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "NewObject", scope: !29, file: !12, line: 277, baseType: !142, size: 32, offset: 896)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!48, !25, !47, !67, null}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "NewObjectV", scope: !29, file: !12, line: 279, baseType: !146, size: 32, offset: 928)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{!48, !25, !47, !67, !149}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !150, line: 72, baseType: !151)
!150 = !DIFile(filename: "C:\\Program Files\\Microsoft Visual Studio\\2022\\Professional\\VC\\Tools\\MSVC\\14.34.31933\\include\\vadefs.h", directory: "", checksumkind: CSK_MD5, checksum: "a4b8f96637d0704c82f39ecb6bde2ab4")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "NewObjectA", scope: !29, file: !12, line: 281, baseType: !153, size: 32, offset: 960)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{!48, !25, !47, !67, !156}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "jvalue", file: !12, line: 130, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "jvalue", file: !12, line: 120, size: 64, elements: !160)
!160 = !{!161, !162, !163, !166, !169, !170, !173, !176, !179}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !159, file: !12, line: 121, baseType: !81, size: 8)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !159, file: !12, line: 122, baseType: !56, size: 8)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !159, file: !12, line: 123, baseType: !164, size: 16)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "jchar", file: !12, line: 58, baseType: !165)
!165 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !159, file: !12, line: 124, baseType: !167, size: 16)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "jshort", file: !12, line: 59, baseType: !168)
!168 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !159, file: !12, line: 125, baseType: !40, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "j", scope: !159, file: !12, line: 126, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "jlong", file: !41, line: 34, baseType: !172)
!172 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !159, file: !12, line: 127, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "jfloat", file: !12, line: 60, baseType: !175)
!175 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !159, file: !12, line: 128, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "jdouble", file: !12, line: 61, baseType: !178)
!178 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !159, file: !12, line: 129, baseType: !48, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "GetObjectClass", scope: !29, file: !12, line: 284, baseType: !181, size: 32, offset: 992)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{!47, !25, !48}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "IsInstanceOf", scope: !29, file: !12, line: 286, baseType: !185, size: 32, offset: 1024)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{!81, !25, !48, !47}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "GetMethodID", scope: !29, file: !12, line: 289, baseType: !189, size: 32, offset: 1056)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!67, !25, !47, !51, !51}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "CallObjectMethod", scope: !29, file: !12, line: 292, baseType: !193, size: 32, offset: 1088)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!48, !25, !48, !67, null}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CallObjectMethodV", scope: !29, file: !12, line: 294, baseType: !197, size: 32, offset: 1120)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{!48, !25, !48, !67, !149}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "CallObjectMethodA", scope: !29, file: !12, line: 296, baseType: !201, size: 32, offset: 1152)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DISubroutineType(types: !203)
!203 = !{!48, !25, !48, !67, !156}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "CallBooleanMethod", scope: !29, file: !12, line: 299, baseType: !205, size: 32, offset: 1184)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{!81, !25, !48, !67, null}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "CallBooleanMethodV", scope: !29, file: !12, line: 301, baseType: !209, size: 32, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{!81, !25, !48, !67, !149}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "CallBooleanMethodA", scope: !29, file: !12, line: 303, baseType: !213, size: 32, offset: 1248)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!81, !25, !48, !67, !156}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "CallByteMethod", scope: !29, file: !12, line: 306, baseType: !217, size: 32, offset: 1280)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{!56, !25, !48, !67, null}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "CallByteMethodV", scope: !29, file: !12, line: 308, baseType: !221, size: 32, offset: 1312)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = !DISubroutineType(types: !223)
!223 = !{!56, !25, !48, !67, !149}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "CallByteMethodA", scope: !29, file: !12, line: 310, baseType: !225, size: 32, offset: 1344)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DISubroutineType(types: !227)
!227 = !{!56, !25, !48, !67, !156}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "CallCharMethod", scope: !29, file: !12, line: 313, baseType: !229, size: 32, offset: 1376)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{!164, !25, !48, !67, null}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CallCharMethodV", scope: !29, file: !12, line: 315, baseType: !233, size: 32, offset: 1408)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DISubroutineType(types: !235)
!235 = !{!164, !25, !48, !67, !149}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "CallCharMethodA", scope: !29, file: !12, line: 317, baseType: !237, size: 32, offset: 1440)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DISubroutineType(types: !239)
!239 = !{!164, !25, !48, !67, !156}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "CallShortMethod", scope: !29, file: !12, line: 320, baseType: !241, size: 32, offset: 1472)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{!167, !25, !48, !67, null}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "CallShortMethodV", scope: !29, file: !12, line: 322, baseType: !245, size: 32, offset: 1504)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{!167, !25, !48, !67, !149}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "CallShortMethodA", scope: !29, file: !12, line: 324, baseType: !249, size: 32, offset: 1536)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{!167, !25, !48, !67, !156}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "CallIntMethod", scope: !29, file: !12, line: 327, baseType: !253, size: 32, offset: 1568)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{!40, !25, !48, !67, null}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "CallIntMethodV", scope: !29, file: !12, line: 329, baseType: !257, size: 32, offset: 1600)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DISubroutineType(types: !259)
!259 = !{!40, !25, !48, !67, !149}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "CallIntMethodA", scope: !29, file: !12, line: 331, baseType: !261, size: 32, offset: 1632)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DISubroutineType(types: !263)
!263 = !{!40, !25, !48, !67, !156}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "CallLongMethod", scope: !29, file: !12, line: 334, baseType: !265, size: 32, offset: 1664)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{!171, !25, !48, !67, null}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "CallLongMethodV", scope: !29, file: !12, line: 336, baseType: !269, size: 32, offset: 1696)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!171, !25, !48, !67, !149}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "CallLongMethodA", scope: !29, file: !12, line: 338, baseType: !273, size: 32, offset: 1728)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{!171, !25, !48, !67, !156}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "CallFloatMethod", scope: !29, file: !12, line: 341, baseType: !277, size: 32, offset: 1760)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{!174, !25, !48, !67, null}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "CallFloatMethodV", scope: !29, file: !12, line: 343, baseType: !281, size: 32, offset: 1792)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = !DISubroutineType(types: !283)
!283 = !{!174, !25, !48, !67, !149}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "CallFloatMethodA", scope: !29, file: !12, line: 345, baseType: !285, size: 32, offset: 1824)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{!174, !25, !48, !67, !156}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "CallDoubleMethod", scope: !29, file: !12, line: 348, baseType: !289, size: 32, offset: 1856)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{!177, !25, !48, !67, null}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CallDoubleMethodV", scope: !29, file: !12, line: 350, baseType: !293, size: 32, offset: 1888)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 32)
!294 = !DISubroutineType(types: !295)
!295 = !{!177, !25, !48, !67, !149}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CallDoubleMethodA", scope: !29, file: !12, line: 352, baseType: !297, size: 32, offset: 1920)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{!177, !25, !48, !67, !156}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "CallVoidMethod", scope: !29, file: !12, line: 355, baseType: !301, size: 32, offset: 1952)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !25, !48, !67, null}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CallVoidMethodV", scope: !29, file: !12, line: 357, baseType: !305, size: 32, offset: 1984)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !25, !48, !67, !149}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "CallVoidMethodA", scope: !29, file: !12, line: 359, baseType: !309, size: 32, offset: 2016)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{null, !25, !48, !67, !156}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualObjectMethod", scope: !29, file: !12, line: 362, baseType: !313, size: 32, offset: 2048)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DISubroutineType(types: !315)
!315 = !{!48, !25, !48, !47, !67, null}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualObjectMethodV", scope: !29, file: !12, line: 364, baseType: !317, size: 32, offset: 2080)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{!48, !25, !48, !47, !67, !149}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualObjectMethodA", scope: !29, file: !12, line: 367, baseType: !321, size: 32, offset: 2112)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{!48, !25, !48, !47, !67, !156}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualBooleanMethod", scope: !29, file: !12, line: 371, baseType: !325, size: 32, offset: 2144)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{!81, !25, !48, !47, !67, null}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualBooleanMethodV", scope: !29, file: !12, line: 373, baseType: !329, size: 32, offset: 2176)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DISubroutineType(types: !331)
!331 = !{!81, !25, !48, !47, !67, !149}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualBooleanMethodA", scope: !29, file: !12, line: 376, baseType: !333, size: 32, offset: 2208)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DISubroutineType(types: !335)
!335 = !{!81, !25, !48, !47, !67, !156}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualByteMethod", scope: !29, file: !12, line: 380, baseType: !337, size: 32, offset: 2240)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!56, !25, !48, !47, !67, null}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualByteMethodV", scope: !29, file: !12, line: 382, baseType: !341, size: 32, offset: 2272)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DISubroutineType(types: !343)
!343 = !{!56, !25, !48, !47, !67, !149}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualByteMethodA", scope: !29, file: !12, line: 385, baseType: !345, size: 32, offset: 2304)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!346 = !DISubroutineType(types: !347)
!347 = !{!56, !25, !48, !47, !67, !156}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualCharMethod", scope: !29, file: !12, line: 389, baseType: !349, size: 32, offset: 2336)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DISubroutineType(types: !351)
!351 = !{!164, !25, !48, !47, !67, null}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualCharMethodV", scope: !29, file: !12, line: 391, baseType: !353, size: 32, offset: 2368)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{!164, !25, !48, !47, !67, !149}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualCharMethodA", scope: !29, file: !12, line: 394, baseType: !357, size: 32, offset: 2400)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{!164, !25, !48, !47, !67, !156}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualShortMethod", scope: !29, file: !12, line: 398, baseType: !361, size: 32, offset: 2432)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = !DISubroutineType(types: !363)
!363 = !{!167, !25, !48, !47, !67, null}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualShortMethodV", scope: !29, file: !12, line: 400, baseType: !365, size: 32, offset: 2464)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DISubroutineType(types: !367)
!367 = !{!167, !25, !48, !47, !67, !149}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualShortMethodA", scope: !29, file: !12, line: 403, baseType: !369, size: 32, offset: 2496)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DISubroutineType(types: !371)
!371 = !{!167, !25, !48, !47, !67, !156}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualIntMethod", scope: !29, file: !12, line: 407, baseType: !373, size: 32, offset: 2528)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{!40, !25, !48, !47, !67, null}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualIntMethodV", scope: !29, file: !12, line: 409, baseType: !377, size: 32, offset: 2560)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{!40, !25, !48, !47, !67, !149}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualIntMethodA", scope: !29, file: !12, line: 412, baseType: !381, size: 32, offset: 2592)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DISubroutineType(types: !383)
!383 = !{!40, !25, !48, !47, !67, !156}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualLongMethod", scope: !29, file: !12, line: 416, baseType: !385, size: 32, offset: 2624)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DISubroutineType(types: !387)
!387 = !{!171, !25, !48, !47, !67, null}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualLongMethodV", scope: !29, file: !12, line: 418, baseType: !389, size: 32, offset: 2656)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{!171, !25, !48, !47, !67, !149}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualLongMethodA", scope: !29, file: !12, line: 421, baseType: !393, size: 32, offset: 2688)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DISubroutineType(types: !395)
!395 = !{!171, !25, !48, !47, !67, !156}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualFloatMethod", scope: !29, file: !12, line: 425, baseType: !397, size: 32, offset: 2720)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DISubroutineType(types: !399)
!399 = !{!174, !25, !48, !47, !67, null}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualFloatMethodV", scope: !29, file: !12, line: 427, baseType: !401, size: 32, offset: 2752)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = !DISubroutineType(types: !403)
!403 = !{!174, !25, !48, !47, !67, !149}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualFloatMethodA", scope: !29, file: !12, line: 430, baseType: !405, size: 32, offset: 2784)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DISubroutineType(types: !407)
!407 = !{!174, !25, !48, !47, !67, !156}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualDoubleMethod", scope: !29, file: !12, line: 434, baseType: !409, size: 32, offset: 2816)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!177, !25, !48, !47, !67, null}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualDoubleMethodV", scope: !29, file: !12, line: 436, baseType: !413, size: 32, offset: 2848)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{!177, !25, !48, !47, !67, !149}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualDoubleMethodA", scope: !29, file: !12, line: 439, baseType: !417, size: 32, offset: 2880)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{!177, !25, !48, !47, !67, !156}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualVoidMethod", scope: !29, file: !12, line: 443, baseType: !421, size: 32, offset: 2912)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !25, !48, !47, !67, null}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualVoidMethodV", scope: !29, file: !12, line: 445, baseType: !425, size: 32, offset: 2944)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !25, !48, !47, !67, !149}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CallNonvirtualVoidMethodA", scope: !29, file: !12, line: 448, baseType: !429, size: 32, offset: 2976)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !25, !48, !47, !67, !156}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "GetFieldID", scope: !29, file: !12, line: 452, baseType: !433, size: 32, offset: 3008)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 32)
!434 = !DISubroutineType(types: !435)
!435 = !{!74, !25, !47, !51, !51}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GetObjectField", scope: !29, file: !12, line: 455, baseType: !437, size: 32, offset: 3040)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DISubroutineType(types: !439)
!439 = !{!48, !25, !48, !74}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "GetBooleanField", scope: !29, file: !12, line: 457, baseType: !441, size: 32, offset: 3072)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!81, !25, !48, !74}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "GetByteField", scope: !29, file: !12, line: 459, baseType: !445, size: 32, offset: 3104)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DISubroutineType(types: !447)
!447 = !{!56, !25, !48, !74}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "GetCharField", scope: !29, file: !12, line: 461, baseType: !449, size: 32, offset: 3136)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DISubroutineType(types: !451)
!451 = !{!164, !25, !48, !74}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "GetShortField", scope: !29, file: !12, line: 463, baseType: !453, size: 32, offset: 3168)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DISubroutineType(types: !455)
!455 = !{!167, !25, !48, !74}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "GetIntField", scope: !29, file: !12, line: 465, baseType: !457, size: 32, offset: 3200)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DISubroutineType(types: !459)
!459 = !{!40, !25, !48, !74}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "GetLongField", scope: !29, file: !12, line: 467, baseType: !461, size: 32, offset: 3232)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DISubroutineType(types: !463)
!463 = !{!171, !25, !48, !74}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "GetFloatField", scope: !29, file: !12, line: 469, baseType: !465, size: 32, offset: 3264)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DISubroutineType(types: !467)
!467 = !{!174, !25, !48, !74}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "GetDoubleField", scope: !29, file: !12, line: 471, baseType: !469, size: 32, offset: 3296)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DISubroutineType(types: !471)
!471 = !{!177, !25, !48, !74}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "SetObjectField", scope: !29, file: !12, line: 474, baseType: !473, size: 32, offset: 3328)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !25, !48, !74, !48}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "SetBooleanField", scope: !29, file: !12, line: 476, baseType: !477, size: 32, offset: 3360)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !25, !48, !74, !81}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "SetByteField", scope: !29, file: !12, line: 478, baseType: !481, size: 32, offset: 3392)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !25, !48, !74, !56}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "SetCharField", scope: !29, file: !12, line: 480, baseType: !485, size: 32, offset: 3424)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !25, !48, !74, !164}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "SetShortField", scope: !29, file: !12, line: 482, baseType: !489, size: 32, offset: 3456)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !25, !48, !74, !167}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "SetIntField", scope: !29, file: !12, line: 484, baseType: !493, size: 32, offset: 3488)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !25, !48, !74, !40}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "SetLongField", scope: !29, file: !12, line: 486, baseType: !497, size: 32, offset: 3520)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !25, !48, !74, !171}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "SetFloatField", scope: !29, file: !12, line: 488, baseType: !501, size: 32, offset: 3552)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !25, !48, !74, !174}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "SetDoubleField", scope: !29, file: !12, line: 490, baseType: !505, size: 32, offset: 3584)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !25, !48, !74, !177}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticMethodID", scope: !29, file: !12, line: 493, baseType: !189, size: 32, offset: 3616)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticObjectMethod", scope: !29, file: !12, line: 496, baseType: !142, size: 32, offset: 3648)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticObjectMethodV", scope: !29, file: !12, line: 498, baseType: !146, size: 32, offset: 3680)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticObjectMethodA", scope: !29, file: !12, line: 500, baseType: !153, size: 32, offset: 3712)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticBooleanMethod", scope: !29, file: !12, line: 503, baseType: !513, size: 32, offset: 3744)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DISubroutineType(types: !515)
!515 = !{!81, !25, !47, !67, null}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticBooleanMethodV", scope: !29, file: !12, line: 505, baseType: !517, size: 32, offset: 3776)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DISubroutineType(types: !519)
!519 = !{!81, !25, !47, !67, !149}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticBooleanMethodA", scope: !29, file: !12, line: 507, baseType: !521, size: 32, offset: 3808)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DISubroutineType(types: !523)
!523 = !{!81, !25, !47, !67, !156}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticByteMethod", scope: !29, file: !12, line: 510, baseType: !525, size: 32, offset: 3840)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DISubroutineType(types: !527)
!527 = !{!56, !25, !47, !67, null}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticByteMethodV", scope: !29, file: !12, line: 512, baseType: !529, size: 32, offset: 3872)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DISubroutineType(types: !531)
!531 = !{!56, !25, !47, !67, !149}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticByteMethodA", scope: !29, file: !12, line: 514, baseType: !533, size: 32, offset: 3904)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DISubroutineType(types: !535)
!535 = !{!56, !25, !47, !67, !156}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticCharMethod", scope: !29, file: !12, line: 517, baseType: !537, size: 32, offset: 3936)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DISubroutineType(types: !539)
!539 = !{!164, !25, !47, !67, null}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticCharMethodV", scope: !29, file: !12, line: 519, baseType: !541, size: 32, offset: 3968)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DISubroutineType(types: !543)
!543 = !{!164, !25, !47, !67, !149}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticCharMethodA", scope: !29, file: !12, line: 521, baseType: !545, size: 32, offset: 4000)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DISubroutineType(types: !547)
!547 = !{!164, !25, !47, !67, !156}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticShortMethod", scope: !29, file: !12, line: 524, baseType: !549, size: 32, offset: 4032)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DISubroutineType(types: !551)
!551 = !{!167, !25, !47, !67, null}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticShortMethodV", scope: !29, file: !12, line: 526, baseType: !553, size: 32, offset: 4064)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{!167, !25, !47, !67, !149}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticShortMethodA", scope: !29, file: !12, line: 528, baseType: !557, size: 32, offset: 4096)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DISubroutineType(types: !559)
!559 = !{!167, !25, !47, !67, !156}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticIntMethod", scope: !29, file: !12, line: 531, baseType: !561, size: 32, offset: 4128)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{!40, !25, !47, !67, null}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticIntMethodV", scope: !29, file: !12, line: 533, baseType: !565, size: 32, offset: 4160)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DISubroutineType(types: !567)
!567 = !{!40, !25, !47, !67, !149}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticIntMethodA", scope: !29, file: !12, line: 535, baseType: !569, size: 32, offset: 4192)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{!40, !25, !47, !67, !156}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticLongMethod", scope: !29, file: !12, line: 538, baseType: !573, size: 32, offset: 4224)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DISubroutineType(types: !575)
!575 = !{!171, !25, !47, !67, null}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticLongMethodV", scope: !29, file: !12, line: 540, baseType: !577, size: 32, offset: 4256)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DISubroutineType(types: !579)
!579 = !{!171, !25, !47, !67, !149}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticLongMethodA", scope: !29, file: !12, line: 542, baseType: !581, size: 32, offset: 4288)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DISubroutineType(types: !583)
!583 = !{!171, !25, !47, !67, !156}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticFloatMethod", scope: !29, file: !12, line: 545, baseType: !585, size: 32, offset: 4320)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{!174, !25, !47, !67, null}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticFloatMethodV", scope: !29, file: !12, line: 547, baseType: !589, size: 32, offset: 4352)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DISubroutineType(types: !591)
!591 = !{!174, !25, !47, !67, !149}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticFloatMethodA", scope: !29, file: !12, line: 549, baseType: !593, size: 32, offset: 4384)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{!174, !25, !47, !67, !156}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticDoubleMethod", scope: !29, file: !12, line: 552, baseType: !597, size: 32, offset: 4416)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!177, !25, !47, !67, null}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticDoubleMethodV", scope: !29, file: !12, line: 554, baseType: !601, size: 32, offset: 4448)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DISubroutineType(types: !603)
!603 = !{!177, !25, !47, !67, !149}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticDoubleMethodA", scope: !29, file: !12, line: 556, baseType: !605, size: 32, offset: 4480)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{!177, !25, !47, !67, !156}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticVoidMethod", scope: !29, file: !12, line: 559, baseType: !609, size: 32, offset: 4512)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !25, !47, !67, null}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticVoidMethodV", scope: !29, file: !12, line: 561, baseType: !613, size: 32, offset: 4544)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{null, !25, !47, !67, !149}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "CallStaticVoidMethodA", scope: !29, file: !12, line: 563, baseType: !617, size: 32, offset: 4576)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !25, !47, !67, !156}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticFieldID", scope: !29, file: !12, line: 566, baseType: !433, size: 32, offset: 4608)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticObjectField", scope: !29, file: !12, line: 568, baseType: !622, size: 32, offset: 4640)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DISubroutineType(types: !624)
!624 = !{!48, !25, !47, !74}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticBooleanField", scope: !29, file: !12, line: 570, baseType: !626, size: 32, offset: 4672)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DISubroutineType(types: !628)
!628 = !{!81, !25, !47, !74}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticByteField", scope: !29, file: !12, line: 572, baseType: !630, size: 32, offset: 4704)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DISubroutineType(types: !632)
!632 = !{!56, !25, !47, !74}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticCharField", scope: !29, file: !12, line: 574, baseType: !634, size: 32, offset: 4736)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{!164, !25, !47, !74}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticShortField", scope: !29, file: !12, line: 576, baseType: !638, size: 32, offset: 4768)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{!167, !25, !47, !74}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticIntField", scope: !29, file: !12, line: 578, baseType: !642, size: 32, offset: 4800)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DISubroutineType(types: !644)
!644 = !{!40, !25, !47, !74}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticLongField", scope: !29, file: !12, line: 580, baseType: !646, size: 32, offset: 4832)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{!171, !25, !47, !74}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticFloatField", scope: !29, file: !12, line: 582, baseType: !650, size: 32, offset: 4864)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DISubroutineType(types: !652)
!652 = !{!174, !25, !47, !74}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "GetStaticDoubleField", scope: !29, file: !12, line: 584, baseType: !654, size: 32, offset: 4896)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{!177, !25, !47, !74}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticObjectField", scope: !29, file: !12, line: 587, baseType: !658, size: 32, offset: 4928)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !25, !47, !74, !48}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticBooleanField", scope: !29, file: !12, line: 589, baseType: !662, size: 32, offset: 4960)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DISubroutineType(types: !664)
!664 = !{null, !25, !47, !74, !81}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticByteField", scope: !29, file: !12, line: 591, baseType: !666, size: 32, offset: 4992)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DISubroutineType(types: !668)
!668 = !{null, !25, !47, !74, !56}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticCharField", scope: !29, file: !12, line: 593, baseType: !670, size: 32, offset: 5024)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{null, !25, !47, !74, !164}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticShortField", scope: !29, file: !12, line: 595, baseType: !674, size: 32, offset: 5056)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !25, !47, !74, !167}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticIntField", scope: !29, file: !12, line: 597, baseType: !678, size: 32, offset: 5088)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !25, !47, !74, !40}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticLongField", scope: !29, file: !12, line: 599, baseType: !682, size: 32, offset: 5120)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !25, !47, !74, !171}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticFloatField", scope: !29, file: !12, line: 601, baseType: !686, size: 32, offset: 5152)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !25, !47, !74, !174}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "SetStaticDoubleField", scope: !29, file: !12, line: 603, baseType: !690, size: 32, offset: 5184)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{null, !25, !47, !74, !177}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "NewString", scope: !29, file: !12, line: 606, baseType: !694, size: 32, offset: 5216)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DISubroutineType(types: !696)
!696 = !{!697, !25, !698, !58}
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "jstring", file: !12, line: 104, baseType: !48)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringLength", scope: !29, file: !12, line: 608, baseType: !701, size: 32, offset: 5248)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = !DISubroutineType(types: !703)
!703 = !{!58, !25, !697}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringChars", scope: !29, file: !12, line: 610, baseType: !705, size: 32, offset: 5280)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DISubroutineType(types: !707)
!707 = !{!698, !25, !697, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseStringChars", scope: !29, file: !12, line: 612, baseType: !710, size: 32, offset: 5312)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !25, !697, !698}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "NewStringUTF", scope: !29, file: !12, line: 615, baseType: !714, size: 32, offset: 5344)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DISubroutineType(types: !716)
!716 = !{!697, !25, !51}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringUTFLength", scope: !29, file: !12, line: 617, baseType: !701, size: 32, offset: 5376)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringUTFChars", scope: !29, file: !12, line: 619, baseType: !719, size: 32, offset: 5408)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DISubroutineType(types: !721)
!721 = !{!51, !25, !697, !708}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseStringUTFChars", scope: !29, file: !12, line: 621, baseType: !723, size: 32, offset: 5440)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DISubroutineType(types: !725)
!725 = !{null, !25, !697, !51}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "GetArrayLength", scope: !29, file: !12, line: 625, baseType: !727, size: 32, offset: 5472)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DISubroutineType(types: !729)
!729 = !{!58, !25, !730}
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "jarray", file: !12, line: 105, baseType: !48)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "NewObjectArray", scope: !29, file: !12, line: 628, baseType: !732, size: 32, offset: 5504)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!735, !25, !58, !47, !48}
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobjectArray", file: !12, line: 114, baseType: !730)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "GetObjectArrayElement", scope: !29, file: !12, line: 630, baseType: !737, size: 32, offset: 5536)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DISubroutineType(types: !739)
!739 = !{!48, !25, !735, !58}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "SetObjectArrayElement", scope: !29, file: !12, line: 632, baseType: !741, size: 32, offset: 5568)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DISubroutineType(types: !743)
!743 = !{null, !25, !735, !58, !48}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "NewBooleanArray", scope: !29, file: !12, line: 635, baseType: !745, size: 32, offset: 5600)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DISubroutineType(types: !747)
!747 = !{!748, !25, !58}
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "jbooleanArray", file: !12, line: 106, baseType: !730)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "NewByteArray", scope: !29, file: !12, line: 637, baseType: !750, size: 32, offset: 5632)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{!753, !25, !58}
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "jbyteArray", file: !12, line: 107, baseType: !730)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "NewCharArray", scope: !29, file: !12, line: 639, baseType: !755, size: 32, offset: 5664)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !25, !58}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "jcharArray", file: !12, line: 108, baseType: !730)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "NewShortArray", scope: !29, file: !12, line: 641, baseType: !760, size: 32, offset: 5696)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DISubroutineType(types: !762)
!762 = !{!763, !25, !58}
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "jshortArray", file: !12, line: 109, baseType: !730)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "NewIntArray", scope: !29, file: !12, line: 643, baseType: !765, size: 32, offset: 5728)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DISubroutineType(types: !767)
!767 = !{!768, !25, !58}
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "jintArray", file: !12, line: 110, baseType: !730)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "NewLongArray", scope: !29, file: !12, line: 645, baseType: !770, size: 32, offset: 5760)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!773, !25, !58}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "jlongArray", file: !12, line: 111, baseType: !730)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "NewFloatArray", scope: !29, file: !12, line: 647, baseType: !775, size: 32, offset: 5792)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{!778, !25, !58}
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "jfloatArray", file: !12, line: 112, baseType: !730)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "NewDoubleArray", scope: !29, file: !12, line: 649, baseType: !780, size: 32, offset: 5824)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!783, !25, !58}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "jdoubleArray", file: !12, line: 113, baseType: !730)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "GetBooleanArrayElements", scope: !29, file: !12, line: 652, baseType: !785, size: 32, offset: 5856)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!708, !25, !748, !708}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "GetByteArrayElements", scope: !29, file: !12, line: 654, baseType: !789, size: 32, offset: 5888)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DISubroutineType(types: !791)
!791 = !{!792, !25, !753, !708}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "GetCharArrayElements", scope: !29, file: !12, line: 656, baseType: !794, size: 32, offset: 5920)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{!797, !25, !758, !708}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "GetShortArrayElements", scope: !29, file: !12, line: 658, baseType: !799, size: 32, offset: 5952)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!802, !25, !763, !708}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "GetIntArrayElements", scope: !29, file: !12, line: 660, baseType: !804, size: 32, offset: 5984)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{!807, !25, !768, !708}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "GetLongArrayElements", scope: !29, file: !12, line: 662, baseType: !809, size: 32, offset: 6016)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!812, !25, !773, !708}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "GetFloatArrayElements", scope: !29, file: !12, line: 664, baseType: !814, size: 32, offset: 6048)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!817, !25, !778, !708}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "GetDoubleArrayElements", scope: !29, file: !12, line: 666, baseType: !819, size: 32, offset: 6080)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!822, !25, !783, !708}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseBooleanArrayElements", scope: !29, file: !12, line: 669, baseType: !824, size: 32, offset: 6112)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = !DISubroutineType(types: !826)
!826 = !{null, !25, !748, !708, !40}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseByteArrayElements", scope: !29, file: !12, line: 671, baseType: !828, size: 32, offset: 6144)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DISubroutineType(types: !830)
!830 = !{null, !25, !753, !792, !40}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseCharArrayElements", scope: !29, file: !12, line: 673, baseType: !832, size: 32, offset: 6176)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DISubroutineType(types: !834)
!834 = !{null, !25, !758, !797, !40}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseShortArrayElements", scope: !29, file: !12, line: 675, baseType: !836, size: 32, offset: 6208)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !25, !763, !802, !40}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseIntArrayElements", scope: !29, file: !12, line: 677, baseType: !840, size: 32, offset: 6240)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !25, !768, !807, !40}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseLongArrayElements", scope: !29, file: !12, line: 679, baseType: !844, size: 32, offset: 6272)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !25, !773, !812, !40}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseFloatArrayElements", scope: !29, file: !12, line: 681, baseType: !848, size: 32, offset: 6304)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DISubroutineType(types: !850)
!850 = !{null, !25, !778, !817, !40}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseDoubleArrayElements", scope: !29, file: !12, line: 683, baseType: !852, size: 32, offset: 6336)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(types: !854)
!854 = !{null, !25, !783, !822, !40}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "GetBooleanArrayRegion", scope: !29, file: !12, line: 686, baseType: !856, size: 32, offset: 6368)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !25, !748, !58, !58, !708}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "GetByteArrayRegion", scope: !29, file: !12, line: 688, baseType: !860, size: 32, offset: 6400)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !25, !753, !58, !58, !792}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "GetCharArrayRegion", scope: !29, file: !12, line: 690, baseType: !864, size: 32, offset: 6432)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !25, !758, !58, !58, !797}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "GetShortArrayRegion", scope: !29, file: !12, line: 692, baseType: !868, size: 32, offset: 6464)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !25, !763, !58, !58, !802}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "GetIntArrayRegion", scope: !29, file: !12, line: 694, baseType: !872, size: 32, offset: 6496)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !25, !768, !58, !58, !807}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "GetLongArrayRegion", scope: !29, file: !12, line: 696, baseType: !876, size: 32, offset: 6528)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !25, !773, !58, !58, !812}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "GetFloatArrayRegion", scope: !29, file: !12, line: 698, baseType: !880, size: 32, offset: 6560)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !25, !778, !58, !58, !817}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "GetDoubleArrayRegion", scope: !29, file: !12, line: 700, baseType: !884, size: 32, offset: 6592)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !25, !783, !58, !58, !822}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SetBooleanArrayRegion", scope: !29, file: !12, line: 703, baseType: !888, size: 32, offset: 6624)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !25, !748, !58, !58, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "SetByteArrayRegion", scope: !29, file: !12, line: 705, baseType: !894, size: 32, offset: 6656)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !25, !753, !58, !58, !54}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "SetCharArrayRegion", scope: !29, file: !12, line: 707, baseType: !898, size: 32, offset: 6688)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !25, !758, !58, !58, !698}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "SetShortArrayRegion", scope: !29, file: !12, line: 709, baseType: !902, size: 32, offset: 6720)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !25, !763, !58, !58, !905}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "SetIntArrayRegion", scope: !29, file: !12, line: 711, baseType: !908, size: 32, offset: 6752)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !25, !768, !58, !58, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "SetLongArrayRegion", scope: !29, file: !12, line: 713, baseType: !914, size: 32, offset: 6784)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !25, !773, !58, !58, !917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "SetFloatArrayRegion", scope: !29, file: !12, line: 715, baseType: !920, size: 32, offset: 6816)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DISubroutineType(types: !922)
!922 = !{null, !25, !778, !58, !58, !923}
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !174)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "SetDoubleArrayRegion", scope: !29, file: !12, line: 717, baseType: !926, size: 32, offset: 6848)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !25, !783, !58, !58, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !177)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RegisterNatives", scope: !29, file: !12, line: 720, baseType: !932, size: 32, offset: 6880)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{!40, !25, !47, !935, !40}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "JNINativeMethod", file: !12, line: 184, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JNINativeMethod", file: !12, line: 180, size: 96, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !12, line: 181, baseType: !151, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !938, file: !12, line: 182, baseType: !151, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "fnPtr", scope: !938, file: !12, line: 183, baseType: !32, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "UnregisterNatives", scope: !29, file: !12, line: 723, baseType: !944, size: 32, offset: 6912)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{!40, !25, !47}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "MonitorEnter", scope: !29, file: !12, line: 726, baseType: !948, size: 32, offset: 6944)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!40, !25, !48}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "MonitorExit", scope: !29, file: !12, line: 728, baseType: !948, size: 32, offset: 6976)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "GetJavaVM", scope: !29, file: !12, line: 731, baseType: !953, size: 32, offset: 7008)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{!40, !25, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "JavaVM", file: !12, line: 211, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JNIInvokeInterface_", file: !12, line: 1890, size: 256, elements: !962)
!962 = !{!963, !964, !965, !966, !970, !975, !976, !980}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "reserved0", scope: !961, file: !12, line: 1891, baseType: !32, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "reserved1", scope: !961, file: !12, line: 1892, baseType: !32, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !961, file: !12, line: 1893, baseType: !32, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "DestroyJavaVM", scope: !961, file: !12, line: 1895, baseType: !967, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!40, !957}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "AttachCurrentThread", scope: !961, file: !12, line: 1897, baseType: !971, size: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DISubroutineType(types: !973)
!973 = !{!40, !957, !974, !32}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "DetachCurrentThread", scope: !961, file: !12, line: 1899, baseType: !967, size: 32, offset: 160)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "GetEnv", scope: !961, file: !12, line: 1901, baseType: !977, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{!40, !957, !974, !40}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "AttachCurrentThreadAsDaemon", scope: !961, file: !12, line: 1903, baseType: !971, size: 32, offset: 224)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringRegion", scope: !29, file: !12, line: 734, baseType: !982, size: 32, offset: 7040)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !25, !697, !58, !58, !797}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringUTFRegion", scope: !29, file: !12, line: 736, baseType: !986, size: 32, offset: 7072)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !25, !697, !58, !58, !151}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "GetPrimitiveArrayCritical", scope: !29, file: !12, line: 739, baseType: !990, size: 32, offset: 7104)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!32, !25, !730, !708}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "ReleasePrimitiveArrayCritical", scope: !29, file: !12, line: 741, baseType: !994, size: 32, offset: 7136)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !25, !730, !32, !40}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "GetStringCritical", scope: !29, file: !12, line: 744, baseType: !705, size: 32, offset: 7168)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "ReleaseStringCritical", scope: !29, file: !12, line: 746, baseType: !710, size: 32, offset: 7200)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "NewWeakGlobalRef", scope: !29, file: !12, line: 749, baseType: !1000, size: 32, offset: 7232)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !25, !48}
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "jweak", file: !12, line: 118, baseType: !48)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "DeleteWeakGlobalRef", scope: !29, file: !12, line: 751, baseType: !1005, size: 32, offset: 7264)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !25, !1003}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ExceptionCheck", scope: !29, file: !12, line: 754, baseType: !1009, size: 32, offset: 7296)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!81, !25}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "NewDirectByteBuffer", scope: !29, file: !12, line: 757, baseType: !1013, size: 32, offset: 7328)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!48, !25, !32, !171}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "GetDirectBufferAddress", scope: !29, file: !12, line: 759, baseType: !1017, size: 32, offset: 7360)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!32, !25, !48}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "GetDirectBufferCapacity", scope: !29, file: !12, line: 761, baseType: !1021, size: 32, offset: 7392)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!171, !25, !48}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "GetObjectRefType", scope: !29, file: !12, line: 766, baseType: !1025, size: 32, offset: 7424)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1028, !25, !48}
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "jobjectRefType", file: !12, line: 144, baseType: !11)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1030, line: 197, baseType: !1031)
!1030 = !DIFile(filename: "C:\\Program Files\\Microsoft Visual Studio\\2022\\Professional\\VC\\Tools\\MSVC\\14.34.31933\\include\\vcruntime.h", directory: "", checksumkind: CSK_MD5, checksum: "39da3a8c8438e40538f3964bd55ef6b8")
!1031 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!1032 = !{!0}
!1033 = !{}
!1034 = !{i32 2, !"CodeView", i32 1}
!1035 = !{i32 2, !"Debug Info Version", i32 3}
!1036 = !{i32 1, !"wchar_size", i32 2}
!1037 = !{i32 1, !"min_enum_size", i32 4}
!1038 = !{i32 7, !"uwtable", i32 2}
!1039 = !{i32 7, !"frame-pointer", i32 2}
!1040 = !{!"clang version 15.0.2"}
!1041 = distinct !DISubprogram(name: "sprintf", scope: !1042, file: !1042, line: 1764, type: !1043, scopeLine: 1771, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1042 = !DIFile(filename: "C:\\Program Files (x86)\\Windows Kits\\10\\Include\\10.0.22621.0\\ucrt\\stdio.h", directory: "", checksumkind: CSK_MD5, checksum: "c1a1fbc43e7d45f0ea4ae539ddcffb19")
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!13, !1045, !1046, null}
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!1047 = !DILocalVariable(name: "_Format", arg: 2, scope: !1041, file: !1042, line: 1766, type: !1046)
!1048 = !DILocation(line: 1766, scope: !1041)
!1049 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !1041, file: !1042, line: 1765, type: !1045)
!1050 = !DILocation(line: 1765, scope: !1041)
!1051 = !DILocalVariable(name: "_Result", scope: !1041, file: !1042, line: 1772, type: !13)
!1052 = !DILocation(line: 1772, scope: !1041)
!1053 = !DILocalVariable(name: "_ArgList", scope: !1041, file: !1042, line: 1773, type: !149)
!1054 = !DILocation(line: 1773, scope: !1041)
!1055 = !DILocation(line: 1774, scope: !1041)
!1056 = !DILocation(line: 1776, scope: !1041)
!1057 = !DILocation(line: 1778, scope: !1041)
!1058 = !DILocation(line: 1779, scope: !1041)
!1059 = distinct !DISubprogram(name: "vsprintf", scope: !1042, file: !1042, line: 1465, type: !1060, scopeLine: 1473, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!13, !1045, !1046, !149}
!1062 = !DILocalVariable(name: "_ArgList", arg: 3, scope: !1059, file: !1042, line: 1468, type: !149)
!1063 = !DILocation(line: 1468, scope: !1059)
!1064 = !DILocalVariable(name: "_Format", arg: 2, scope: !1059, file: !1042, line: 1467, type: !1046)
!1065 = !DILocation(line: 1467, scope: !1059)
!1066 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !1059, file: !1042, line: 1466, type: !1045)
!1067 = !DILocation(line: 1466, scope: !1059)
!1068 = !DILocation(line: 1474, scope: !1059)
!1069 = distinct !DISubprogram(name: "_snprintf", scope: !1042, file: !1042, line: 1939, type: !1070, scopeLine: 1947, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!13, !1045, !1072, !1046, null}
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1073 = !DILocalVariable(name: "_Format", arg: 3, scope: !1069, file: !1042, line: 1942, type: !1046)
!1074 = !DILocation(line: 1942, scope: !1069)
!1075 = !DILocalVariable(name: "_BufferCount", arg: 2, scope: !1069, file: !1042, line: 1941, type: !1072)
!1076 = !DILocation(line: 1941, scope: !1069)
!1077 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !1069, file: !1042, line: 1940, type: !1045)
!1078 = !DILocation(line: 1940, scope: !1069)
!1079 = !DILocalVariable(name: "_Result", scope: !1069, file: !1042, line: 1948, type: !13)
!1080 = !DILocation(line: 1948, scope: !1069)
!1081 = !DILocalVariable(name: "_ArgList", scope: !1069, file: !1042, line: 1949, type: !149)
!1082 = !DILocation(line: 1949, scope: !1069)
!1083 = !DILocation(line: 1950, scope: !1069)
!1084 = !DILocation(line: 1951, scope: !1069)
!1085 = !DILocation(line: 1952, scope: !1069)
!1086 = !DILocation(line: 1953, scope: !1069)
!1087 = distinct !DISubprogram(name: "_vsnprintf", scope: !1042, file: !1042, line: 1402, type: !1088, scopeLine: 1411, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!13, !1045, !1072, !1046, !149}
!1090 = !DILocalVariable(name: "_ArgList", arg: 4, scope: !1087, file: !1042, line: 1406, type: !149)
!1091 = !DILocation(line: 1406, scope: !1087)
!1092 = !DILocalVariable(name: "_Format", arg: 3, scope: !1087, file: !1042, line: 1405, type: !1046)
!1093 = !DILocation(line: 1405, scope: !1087)
!1094 = !DILocalVariable(name: "_BufferCount", arg: 2, scope: !1087, file: !1042, line: 1404, type: !1072)
!1095 = !DILocation(line: 1404, scope: !1087)
!1096 = !DILocalVariable(name: "_Buffer", arg: 1, scope: !1087, file: !1042, line: 1403, type: !1045)
!1097 = !DILocation(line: 1403, scope: !1087)
!1098 = !DILocation(line: 1412, scope: !1087)
!1099 = distinct !DISubprogram(name: "JNI_CallObjectMethod", scope: !9, file: !9, line: 3, type: !194, scopeLine: 3, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1100 = !DILocalVariable(name: "methodID", arg: 3, scope: !1099, file: !9, line: 3, type: !67)
!1101 = !DILocation(line: 3, scope: !1099)
!1102 = !DILocalVariable(name: "obj", arg: 2, scope: !1099, file: !9, line: 3, type: !48)
!1103 = !DILocalVariable(name: "pEnv", arg: 1, scope: !1099, file: !9, line: 3, type: !25)
!1104 = !DILocalVariable(name: "args", scope: !1099, file: !9, line: 3, type: !149)
!1105 = !DILocalVariable(name: "sig", scope: !1099, file: !9, line: 3, type: !1106)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 2048, elements: !1107)
!1107 = !{!1108}
!1108 = !DISubrange(count: 256)
!1109 = !DILocalVariable(name: "argv", scope: !1099, file: !9, line: 3, type: !1110)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 16384, elements: !1107)
!1111 = !DILocalVariable(name: "argc", scope: !1099, file: !9, line: 3, type: !13)
!1112 = !DILocalVariable(name: "i", scope: !1113, file: !9, line: 3, type: !13)
!1113 = distinct !DILexicalBlock(scope: !1099, file: !9, line: 3)
!1114 = !DILocation(line: 3, scope: !1113)
!1115 = !DILocation(line: 3, scope: !1116)
!1116 = distinct !DILexicalBlock(scope: !1117, file: !9, line: 3)
!1117 = distinct !DILexicalBlock(scope: !1113, file: !9, line: 3)
!1118 = !DILocation(line: 3, scope: !1119)
!1119 = distinct !DILexicalBlock(scope: !1116, file: !9, line: 3)
!1120 = !DILocation(line: 3, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1119, file: !9, line: 3)
!1122 = !DILocation(line: 3, scope: !1123)
!1123 = distinct !DILexicalBlock(scope: !1121, file: !9, line: 3)
!1124 = !DILocation(line: 3, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1123, file: !9, line: 3)
!1126 = !DILocation(line: 3, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1125, file: !9, line: 3)
!1128 = !DILocation(line: 3, scope: !1129)
!1129 = distinct !DILexicalBlock(scope: !1127, file: !9, line: 3)
!1130 = !DILocation(line: 3, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1129, file: !9, line: 3)
!1132 = !DILocation(line: 3, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1131, file: !9, line: 3)
!1134 = !DILocation(line: 3, scope: !1135)
!1135 = distinct !DILexicalBlock(scope: !1133, file: !9, line: 3)
!1136 = !DILocation(line: 3, scope: !1117)
!1137 = distinct !{!1137, !1114, !1114, !1138}
!1138 = !{!"llvm.loop.mustprogress"}
!1139 = !DILocalVariable(name: "ret", scope: !1099, file: !9, line: 3, type: !48)
!1140 = distinct !DISubprogram(name: "JNI_CallObjectMethodV", scope: !9, file: !9, line: 3, type: !198, scopeLine: 3, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1141 = !DILocalVariable(name: "args", arg: 4, scope: !1140, file: !9, line: 3, type: !149)
!1142 = !DILocation(line: 3, scope: !1140)
!1143 = !DILocalVariable(name: "methodID", arg: 3, scope: !1140, file: !9, line: 3, type: !67)
!1144 = !DILocalVariable(name: "obj", arg: 2, scope: !1140, file: !9, line: 3, type: !48)
!1145 = !DILocalVariable(name: "pEnv", arg: 1, scope: !1140, file: !9, line: 3, type: !25)
!1146 = !DILocalVariable(name: "sig", scope: !1140, file: !9, line: 3, type: !1106)
!1147 = !DILocalVariable(name: "argv", scope: !1140, file: !9, line: 3, type: !1110)
!1148 = !DILocalVariable(name: "argc", scope: !1140, file: !9, line: 3, type: !13)
!1149 = !DILocalVariable(name: "i", scope: !1150, file: !9, line: 3, type: !13)
!1150 = distinct !DILexicalBlock(scope: !1140, file: !9, line: 3)
!1151 = !DILocation(line: 3, scope: !1150)
!1152 = !DILocation(line: 3, scope: !1153)
!1153 = distinct !DILexicalBlock(scope: !1154, file: !9, line: 3)
!1154 = distinct !DILexicalBlock(scope: !1150, file: !9, line: 3)
!1155 = !DILocation(line: 3, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1153, file: !9, line: 3)
!1157 = !DILocation(line: 3, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1156, file: !9, line: 3)
!1159 = !DILocation(line: 3, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1158, file: !9, line: 3)
!1161 = !DILocation(line: 3, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1160, file: !9, line: 3)
!1163 = !DILocation(line: 3, scope: !1164)
!1164 = distinct !DILexicalBlock(scope: !1162, file: !9, line: 3)
!1165 = !DILocation(line: 3, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1164, file: !9, line: 3)
!1167 = !DILocation(line: 3, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1166, file: !9, line: 3)
!1169 = !DILocation(line: 3, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1168, file: !9, line: 3)
!1171 = !DILocation(line: 3, scope: !1172)
!1172 = distinct !DILexicalBlock(scope: !1170, file: !9, line: 3)
!1173 = !DILocation(line: 3, scope: !1154)
!1174 = distinct !{!1174, !1151, !1151, !1138}
!1175 = distinct !DISubprogram(name: "JNI_CallNonvirtualObjectMethod", scope: !9, file: !9, line: 3, type: !314, scopeLine: 3, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1176 = !DILocalVariable(name: "methodID", arg: 4, scope: !1175, file: !9, line: 3, type: !67)
!1177 = !DILocation(line: 3, scope: !1175)
!1178 = !DILocalVariable(name: "clazz", arg: 3, scope: !1175, file: !9, line: 3, type: !47)
!1179 = !DILocalVariable(name: "obj", arg: 2, scope: !1175, file: !9, line: 3, type: !48)
!1180 = !DILocalVariable(name: "pEnv", arg: 1, scope: !1175, file: !9, line: 3, type: !25)
!1181 = !DILocalVariable(name: "args", scope: !1175, file: !9, line: 3, type: !149)
!1182 = !DILocalVariable(name: "sig", scope: !1175, file: !9, line: 3, type: !1106)
!1183 = !DILocalVariable(name: "argv", scope: !1175, file: !9, line: 3, type: !1110)
!1184 = !DILocalVariable(name: "argc", scope: !1175, file: !9, line: 3, type: !13)
!1185 = !DILocalVariable(name: "i", scope: !1186, file: !9, line: 3, type: !13)
!1186 = distinct !DILexicalBlock(scope: !1175, file: !9, line: 3)
!1187 = !DILocation(line: 3, scope: !1186)
!1188 = !DILocation(line: 3, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1190, file: !9, line: 3)
!1190 = distinct !DILexicalBlock(scope: !1186, file: !9, line: 3)
!1191 = !DILocation(line: 3, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !9, line: 3)
!1193 = !DILocation(line: 3, scope: !1194)
!1194 = distinct !DILexicalBlock(scope: !1192, file: !9, line: 3)
!1195 = !DILocation(line: 3, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1194, file: !9, line: 3)
!1197 = !DILocation(line: 3, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1196, file: !9, line: 3)
!1199 = !DILocation(line: 3, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1198, file: !9, line: 3)
!1201 = !DILocation(line: 3, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1200, file: !9, line: 3)
!1203 = !DILocation(line: 3, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !1202, file: !9, line: 3)
!1205 = !DILocation(line: 3, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1204, file: !9, line: 3)
!1207 = !DILocation(line: 3, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1206, file: !9, line: 3)
!1209 = !DILocation(line: 3, scope: !1190)
!1210 = distinct !{!1210, !1187, !1187, !1138}
!1211 = !DILocalVariable(name: "ret", scope: !1175, file: !9, line: 3, type: !48)
!1212 = distinct !DISubprogram(name: "JNI_CallNonvirtualObjectMethodV", scope: !9, file: !9, line: 3, type: !318, scopeLine: 3, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1213 = !DILocalVariable(name: "args", arg: 5, scope: !1212, file: !9, line: 3, type: !149)
!1214 = !DILocation(line: 3, scope: !1212)
!1215 = !DILocalVariable(name: "methodID", arg: 4, scope: !1212, file: !9, line: 3, type: !67)
!1216 = !DILocalVariable(name: "clazz", arg: 3, scope: !1212, file: !9, line: 3, type: !47)
!1217 = !DILocalVariable(name: "obj", arg: 2, scope: !1212, file: !9, line: 3, type: !48)
!1218 = !DILocalVariable(name: "pEnv", arg: 1, scope: !1212, file: !9, line: 3, type: !25)
!1219 = !DILocalVariable(name: "sig", scope: !1212, file: !9, line: 3, type: !1106)
!1220 = !DILocalVariable(name: "argv", scope: !1212, file: !9, line: 3, type: !1110)
!1221 = !DILocalVariable(name: "argc", scope: !1212, file: !9, line: 3, type: !13)
!1222 = !DILocalVariable(name: "i", scope: !1223, file: !9, line: 3, type: !13)
!1223 = distinct !DILexicalBlock(scope: !1212, file: !9, line: 3)
!1224 = !DILocation(line: 3, scope: !1223)
!1225 = !DILocation(line: 3, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !9, line: 3)
!1227 = distinct !DILexicalBlock(scope: !1223, file: !9, line: 3)
!1228 = !DILocation(line: 3, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1226, file: !9, line: 3)
!1230 = !DILocation(line: 3, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1229, file: !9, line: 3)
!1232 = !DILocation(line: 3, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1231, file: !9, line: 3)
!1234 = !DILocation(line: 3, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1233, file: !9, line: 3)
!1236 = !DILocation(line: 3, scope: !1237)
!1237 = distinct !DILexicalBlock(scope: !1235, file: !9, line: 3)
!1238 = !DILocation(line: 3, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1237, file: !9, line: 3)
!1240 = !DILocation(line: 3, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1239, file: !9, line: 3)
!1242 = !DILocation(line: 3, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1241, file: !9, line: 3)
!1244 = !DILocation(line: 3, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1243, file: !9, line: 3)
!1246 = !DILocation(line: 3, scope: !1227)
!1247 = distinct !{!1247, !1224, !1224, !1138}
!1248 = distinct !DISubprogram(name: "JNI_CallStaticObjectMethod", scope: !9, file: !9, line: 3, type: !143, scopeLine: 3, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1249 = !DILocalVariable(name: "methodID", arg: 3, scope: !1248, file: !9, line: 3, type: !67)
!1250 = !DILocation(line: 3, scope: !1248)
!1251 = !DILocalVariable(name: "clazz", arg: 2, scope: !1248, file: !9, line: 3, type: !47)
!1252 = !DILocalVariable(name: "pEnv", arg: 1, scope: !1248, file: !9, line: 3, type: !25)
!1253 = !DILocalVariable(name: "args", scope: !1248, file: !9, line: 3, type: !149)
!1254 = !DILocalVariable(name: "sig", scope: !1248, file: !9, line: 3, type: !1106)
!1255 = !DILocalVariable(name: "argv", scope: !1248, file: !9, line: 3, type: !1110)
!1256 = !DILocalVariable(name: "argc", scope: !1248, file: !9, line: 3, type: !13)
!1257 = !DILocalVariable(name: "i", scope: !1258, file: !9, line: 3, type: !13)
!1258 = distinct !DILexicalBlock(scope: !1248, file: !9, line: 3)
!1259 = !DILocation(line: 3, scope: !1258)
!1260 = !DILocation(line: 3, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !9, line: 3)
!1262 = distinct !DILexicalBlock(scope: !1258, file: !9, line: 3)
!1263 = !DILocation(line: 3, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1261, file: !9, line: 3)
!1265 = !DILocation(line: 3, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1264, file: !9, line: 3)
!1267 = !DILocation(line: 3, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1266, file: !9, line: 3)
!1269 = !DILocation(line: 3, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1268, file: !9, line: 3)
!1271 = !DILocation(line: 3, scope: !1272)
!1272 = distinct !DILexicalBlock(scope: !1270, file: !9, line: 3)
!1273 = !DILocation(line: 3, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1272, file: !9, line: 3)
!1275 = !DILocation(line: 3, scope: !1276)
!1276 = distinct !DILexicalBlock(scope: !1274, file: !9, line: 3)
!1277 = !DILocation(line: 3, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1276, file: !9, line: 3)
!1279 = !DILocation(line: 3, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1278, file: !9, line: 3)
!1281 = !DILocation(line: 3, scope: !1262)
!1282 = distinct !{!1282, !1259, !1259, !1138}
!1283 = !DILocalVariable(name: "ret", scope: !1248, file: !9, line: 3, type: !48)
!1284 = distinct !DISubprogram(name: "JNI_CallStaticObjectMethodV", scope: !9, file: !9, line: 3, type: !147, scopeLine: 3, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !8, retainedNodes: !1033)
!1285 = !DILocalVariable(name: "args", arg: 4, scope: !1284, file: !9, line: 3, type: !149)
!1286 = !DILocation(line: 3, scope: !1284)
!1287 = !DILocalVariable(name: "methodID", arg: 3, scope: !1284, file: !9, line: 3, type: !67)
!1288 = !DILocalVariable(name: "clazz", arg: 2, scope: !1284, file: !9, line: 3, type: !47)
!1289 = !DILocalVariable(name: "pEnv", arg: 1, scope: !1284, file: !9, line: 3, type: !25)
!1290 = !DILocalVariable(name: "sig", scope: !1284, file: !9, line: 3, type: !1106)
!1291 = !DILocalVariable(name: "argv", scope: !1284, file: !9, line: 3, type: !1110)
!1292 = !DILocalVariable(name: "argc", scope: !1284, file: !9, line: 3, type: !13)
!1293 = !DILocalVariable(name: "i", scope: !1294, file: !9, line: 3, type: !13)
!1294 = distinct !DILexicalBlock(scope: !1284, file: !9, line: 3)
!1295 = !DILocation(line: 3, scope: !1294)
!1296 = !DILocation(line: 3, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1298, file: !9, line: 3)
!1298 = distinct !DILexicalBlock(scope: !1294, file: !9, line: 3)
!1299 = !DILocation(line: 3, scope: !1300)
!1300 = distinct !DILexicalBlock(scope: !1297, file: !9, line: 3)
!1301 = !DILocation(line: 3, scope: !1302)
